; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v10 ?v6)
             (pred_4 ?v9 ?v11)
             (pred_7 ?v10 ?v11)
             (pred_9 ?v5 ?v10 )
	     (pred_5 ?v10)
             (pred_11 ?v7)
             (pred_8 ?v9)
             (pred_1 ?v11)
             (pred_12 ?v10)
             (pred_3 ?v9)
             (pred_6 ?v10)
             (pred_2 ))



(:action op_3
:parameters (?v13 ?v2 ?v3 ?v4)
:precondition (and (pred_11 ?v13) (pred_11 ?v2) (pred_8 ?v3) (pred_1 ?v4)
          (pred_10 ?v13 ?v2) (pred_4 ?v3 ?v4)
                   (pred_7 ?v2 ?v4) (pred_5 ?v13) 
                   (pred_12 ?v2) (pred_3 ?v3))
:effect (and  (pred_6 ?v2) (not (pred_12 ?v2))))


(:action op_2
:parameters (?v13 ?v1)
:precondition (and (pred_11 ?v13) (pred_11 ?v1)
               (pred_5 ?v13) (pred_10 ?v13 ?v1) (pred_6 ?v1))
:effect (and (pred_5 ?v1) (not (pred_5 ?v13))))

(:action op_5
:parameters (?v13 ?v3)
:precondition (and (pred_11 ?v13) (pred_8 ?v3) 
                  (pred_5 ?v13) (pred_9 ?v3 ?v13) (pred_2 ))
:effect (and (pred_3 ?v3)
   (not (pred_9 ?v3 ?v13)) (not (pred_2 ))))


(:action op_4
:parameters (?v13 ?v12 ?v8)
:precondition (and (pred_11 ?v13) (pred_8 ?v12) (pred_8 ?v8)
                  (pred_5 ?v13) (pred_3 ?v8) (pred_9 ?v12 ?v13))
:effect (and (pred_3 ?v12) (pred_9 ?v8 ?v13)
        (not (pred_3 ?v8)) (not (pred_9 ?v12 ?v13))))

(:action op_1
:parameters (?v13 ?v3)
:precondition (and (pred_11 ?v13) (pred_8 ?v3) 
                  (pred_5 ?v13) (pred_3 ?v3))
:effect (and (pred_2 ) (pred_9 ?v3 ?v13) (not (pred_3 ?v3)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_04 obj_20 obj_07 obj_19 obj_26 obj_09 obj_13 obj_32 obj_14 obj_16 obj_11 obj_31 obj_22 obj_24 obj_30 obj_02 obj_08 obj_21 obj_29 obj_12 obj_27 obj_15 obj_03 obj_28 obj_10
    obj_06 obj_05 obj_17
    obj_01 obj_25 obj_18 obj_23
    )

    (:init
       (pred_2)

       (pred_11 obj_04)
       (pred_11 obj_20)
       (pred_11 obj_07)
       (pred_11 obj_19)
       (pred_11 obj_26)
       (pred_11 obj_09)
       (pred_11 obj_13)
       (pred_11 obj_32)
       (pred_11 obj_14)
       (pred_11 obj_16)
       (pred_11 obj_11)
       (pred_11 obj_31)
       (pred_11 obj_22)
       (pred_11 obj_24)
       (pred_11 obj_30)
       (pred_11 obj_02)
       (pred_11 obj_08)
       (pred_11 obj_21)
       (pred_11 obj_29)
       (pred_11 obj_12)
       (pred_11 obj_27)
       (pred_11 obj_15)
       (pred_11 obj_03)
       (pred_11 obj_28)
       (pred_11 obj_10)
       (pred_1 obj_06)
       (pred_1 obj_05)
       (pred_1 obj_17)
       (pred_8 obj_01)
       (pred_8 obj_25)
       (pred_8 obj_18)
       (pred_8 obj_23)

       (pred_10 obj_04 obj_09)
       (pred_10 obj_04 obj_20)
       (pred_10 obj_20 obj_13)
       (pred_10 obj_20 obj_07)
       (pred_10 obj_20 obj_04)
       (pred_10 obj_07 obj_32)
       (pred_10 obj_07 obj_19)
       (pred_10 obj_07 obj_20)
       (pred_10 obj_19 obj_14)
       (pred_10 obj_19 obj_26)
       (pred_10 obj_19 obj_07)
       (pred_10 obj_26 obj_16)
       (pred_10 obj_26 obj_19)
       (pred_10 obj_09 obj_11)
       (pred_10 obj_09 obj_13)
       (pred_10 obj_09 obj_04)
       (pred_10 obj_13 obj_31)
       (pred_10 obj_13 obj_32)
       (pred_10 obj_13 obj_20)
       (pred_10 obj_13 obj_09)
       (pred_10 obj_32 obj_22)
       (pred_10 obj_32 obj_14)
       (pred_10 obj_32 obj_07)
       (pred_10 obj_32 obj_13)
       (pred_10 obj_14 obj_24)
       (pred_10 obj_14 obj_16)
       (pred_10 obj_14 obj_19)
       (pred_10 obj_14 obj_32)
       (pred_10 obj_16 obj_30)
       (pred_10 obj_16 obj_26)
       (pred_10 obj_16 obj_14)
       (pred_10 obj_11 obj_02)
       (pred_10 obj_11 obj_31)
       (pred_10 obj_11 obj_09)
       (pred_10 obj_31 obj_08)
       (pred_10 obj_31 obj_22)
       (pred_10 obj_31 obj_13)
       (pred_10 obj_31 obj_11)
       (pred_10 obj_22 obj_21)
       (pred_10 obj_22 obj_24)
       (pred_10 obj_22 obj_32)
       (pred_10 obj_22 obj_31)
       (pred_10 obj_24 obj_29)
       (pred_10 obj_24 obj_30)
       (pred_10 obj_24 obj_14)
       (pred_10 obj_24 obj_22)
       (pred_10 obj_30 obj_12)
       (pred_10 obj_30 obj_16)
       (pred_10 obj_30 obj_24)
       (pred_10 obj_02 obj_27)
       (pred_10 obj_02 obj_08)
       (pred_10 obj_02 obj_11)
       (pred_10 obj_08 obj_15)
       (pred_10 obj_08 obj_21)
       (pred_10 obj_08 obj_31)
       (pred_10 obj_08 obj_02)
       (pred_10 obj_21 obj_03)
       (pred_10 obj_21 obj_29)
       (pred_10 obj_21 obj_22)
       (pred_10 obj_21 obj_08)
       (pred_10 obj_29 obj_28)
       (pred_10 obj_29 obj_12)
       (pred_10 obj_29 obj_24)
       (pred_10 obj_29 obj_21)
       (pred_10 obj_12 obj_10)
       (pred_10 obj_12 obj_30)
       (pred_10 obj_12 obj_29)
       (pred_10 obj_27 obj_15)
       (pred_10 obj_27 obj_02)
       (pred_10 obj_15 obj_03)
       (pred_10 obj_15 obj_08)
       (pred_10 obj_15 obj_27)
       (pred_10 obj_03 obj_28)
       (pred_10 obj_03 obj_21)
       (pred_10 obj_03 obj_15)
       (pred_10 obj_28 obj_10)
       (pred_10 obj_28 obj_29)
       (pred_10 obj_28 obj_03)
       (pred_10 obj_10 obj_12)
       (pred_10 obj_10 obj_28)
       (pred_12 obj_12)
       (pred_12 obj_02)
       (pred_12 obj_24)
       (pred_12 obj_08)
       (pred_7  obj_12 obj_06)
       (pred_7  obj_02 obj_05)
       (pred_7  obj_24 obj_17)
       (pred_7  obj_08 obj_17)
       (pred_6 obj_04)
       (pred_6 obj_20)
       (pred_6 obj_07)
       (pred_6 obj_19)
       (pred_6 obj_26)
       (pred_6 obj_09)
       (pred_6 obj_13)
       (pred_6 obj_32)
       (pred_6 obj_14)
       (pred_6 obj_16)
       (pred_6 obj_11)
       (pred_6 obj_31)
       (pred_6 obj_22)
       (pred_6 obj_30)
       (pred_6 obj_21)
       (pred_6 obj_29)
       (pred_6 obj_27)
       (pred_6 obj_15)
       (pred_6 obj_03)
       (pred_6 obj_28)
       (pred_6 obj_10)

       (pred_4  obj_01 obj_06)
       (pred_4  obj_25 obj_05)
       (pred_4  obj_18 obj_17)
       (pred_4  obj_23 obj_05)
       (pred_9 obj_01 obj_26)
       (pred_9 obj_25 obj_28)
       (pred_9 obj_18 obj_03)
       (pred_9 obj_23 obj_09)
       (pred_5 obj_31)
    )

    (:goal (and
       (pred_9 obj_01 obj_27)
       (pred_9 obj_25 obj_11)
       (pred_9 obj_18 obj_32)
       (pred_9 obj_23 obj_02)
    ))
(:constraints
  (always (not (pred_5 obj_19)))
)
)

; plan
1. (op_2 obj_31 obj_22)
   deleted: (pred_5 obj_31)
   added: (pred_5 obj_22)
   goals met: 0 of 4
2. (op_2 obj_22 obj_21)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_21)
   goals met: 0 of 4
3. (op_2 obj_21 obj_03)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_03)
   goals met: 0 of 4
4. (op_2 obj_03 obj_28)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_28)
   goals met: 0 of 4
5. (op_5 obj_28 obj_25)
   deleted: (pred_9 obj_25 obj_28) (pred_2)
   added: (pred_3 obj_25)
   goals met: 0 of 4
6. (op_2 obj_28 obj_03)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_03)
   goals met: 0 of 4
7. (op_2 obj_03 obj_15)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_15)
   goals met: 0 of 4
8. (op_2 obj_15 obj_27)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_27)
   goals met: 0 of 4
9. (op_3 obj_27 obj_02 obj_25 obj_05)
   deleted: (pred_12 obj_02)
   added: (pred_6 obj_02)
   goals met: 0 of 4
10. (op_1 obj_27 obj_25)
   deleted: (pred_3 obj_25)
   added: (pred_2) (pred_9 obj_25 obj_27)
   goals met: 0 of 4
11. (op_2 obj_27 obj_15)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_15)
   goals met: 0 of 4
12. (op_2 obj_15 obj_03)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_03)
   goals met: 0 of 4
13. (op_5 obj_03 obj_18)
   deleted: (pred_9 obj_18 obj_03) (pred_2)
   added: (pred_3 obj_18)
   goals met: 0 of 4
14. (op_2 obj_03 obj_15)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_15)
   goals met: 0 of 4
15. (op_2 obj_15 obj_27)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_27)
   goals met: 0 of 4
16. (op_2 obj_27 obj_02)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_02)
   goals met: 0 of 4
17. (op_2 obj_02 obj_11)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_11)
   goals met: 0 of 4
18. (op_1 obj_11 obj_18)
   deleted: (pred_3 obj_18)
   added: (pred_2) (pred_9 obj_18 obj_11)
   goals met: 0 of 4
19. (op_2 obj_11 obj_09)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_09)
   goals met: 0 of 4
20. (op_5 obj_09 obj_23)
   deleted: (pred_9 obj_23 obj_09) (pred_2)
   added: (pred_3 obj_23)
   goals met: 0 of 4
21. (op_2 obj_09 obj_11)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_11)
   goals met: 0 of 4
22. (op_2 obj_11 obj_02)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_02)
   goals met: 0 of 4
23. (op_1 obj_02 obj_23)
   deleted: (pred_3 obj_23)
   added: (pred_2) (pred_9 obj_23 obj_02)
   goals met: 1 of 4
24. (op_2 obj_02 obj_11)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_11)
   goals met: 1 of 4
25. (op_5 obj_11 obj_18)
   deleted: (pred_9 obj_18 obj_11) (pred_2)
   added: (pred_3 obj_18)
   goals met: 1 of 4
26. (op_2 obj_11 obj_31)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_31)
   goals met: 1 of 4
27. (op_2 obj_31 obj_22)
   deleted: (pred_5 obj_31)
   added: (pred_5 obj_22)
   goals met: 1 of 4
28. (op_2 obj_22 obj_32)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_32)
   goals met: 1 of 4
29. (op_1 obj_32 obj_18)
   deleted: (pred_3 obj_18)
   added: (pred_2) (pred_9 obj_18 obj_32)
   goals met: 2 of 4
30. (op_2 obj_32 obj_14)
   deleted: (pred_5 obj_32)
   added: (pred_5 obj_14)
   goals met: 2 of 4
31. (op_2 obj_14 obj_16)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_16)
   goals met: 2 of 4
32. (op_2 obj_16 obj_26)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_26)
   goals met: 2 of 4
33. (op_5 obj_26 obj_01)
   deleted: (pred_9 obj_01 obj_26) (pred_2)
   added: (pred_3 obj_01)
   goals met: 2 of 4
34. (op_2 obj_26 obj_16)
   deleted: (pred_5 obj_26)
   added: (pred_5 obj_16)
   goals met: 2 of 4
35. (op_2 obj_16 obj_14)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_14)
   goals met: 2 of 4
36. (op_2 obj_14 obj_32)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_32)
   goals met: 2 of 4
37. (op_2 obj_32 obj_13)
   deleted: (pred_5 obj_32)
   added: (pred_5 obj_13)
   goals met: 2 of 4
38. (op_2 obj_13 obj_09)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_09)
   goals met: 2 of 4
39. (op_2 obj_09 obj_11)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_11)
   goals met: 2 of 4
40. (op_2 obj_11 obj_02)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_02)
   goals met: 2 of 4
41. (op_2 obj_02 obj_27)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_27)
   goals met: 2 of 4
42. (op_4 obj_27 obj_25 obj_01)
   deleted: (pred_3 obj_01) (pred_9 obj_25 obj_27)
   added: (pred_3 obj_25) (pred_9 obj_01 obj_27)
   goals met: 3 of 4
43. (op_2 obj_27 obj_02)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_02)
   goals met: 3 of 4
44. (op_2 obj_02 obj_11)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_11)
   goals met: 3 of 4
45. (op_1 obj_11 obj_25)
   deleted: (pred_3 obj_25)
   added: (pred_2) (pred_9 obj_25 obj_11)
   goals met: 4 of 4
